[
    {
        "title": "Traffic Violation App",
        "subtitle": "Developed Fall 2022",
        "description": "This Traffic Violation app was written as part of a course focused on complex software systems and the development lifecycle. It is a Java application designed for issuing and paying for parking tickets, registering vehicles, and purchasing parking passes. The goal of the project was to demonstrate understanding of the software development lifecycle and the ability to design and implement a complete software system. This project involved the use of Java Swing for the graphical user interface and Java programming concepts such as object-oriented design, event handling, and data structures. As is a recurring theme in the projects I develop, a strong emphasis was placed on the look and feel of the program (no easy feat when developing with Java Swing). The app was designed to mimic Penn State’s current ticketing system as demonstrated by the blue color palette and logo.",
        "skills": ["Java"],
        "repoLink": "https://github.com/CaseySharpe/IST412TrafficApp",
        "mediaLink": "https://www.youtube.com/embed/c6XKtufYwBI?autoplay=1"
      },
      {
        "title": "Color Chatbot",
        "subtitle": "Developed Spring 2022",
        "description": "The ColorBot App was written as part of a course studying Object-Oriented programming and Java app development. This chatbot utilized an algorithm to determine the domain area the user was discussing and respond accordingly. The chatbot was designed to be communicative and was capable of generic conversational phrases as well as generating colors based on user input. The user is able to generate random colors, the complement of each color, as well as modify the colors, making them darker or lighter. The app utilized Java programming concepts such as algorithms, data structures, and event handling to provide an interactive and dynamic user experience. The intention of the app was to provide an interactive program for UX designers and developers to generate colors and color palettes with their corresponding RGB color codes for design projects.",
        "skills": ["Java"],
        "repoLink": "https://github.com/CaseySharpe/261ChatbotProject",
        "mediaLink": "https://www.youtube.com/embed/yuWN8gtDofI?autoplay=1"
      },
      {
        "title": "CinemaCache App",
        "subtitle": "Developed Fall 2022",
        "description": "CinemaCache app was created as a part of a course in Android Studio Development. The app allows users to randomly selects movies given a set of genre filters, view all movies, add movies to a watchlist, and review movies.",
        "skills": ["Java", "Android Developer"],
        "repoLink": "https://github.com/CaseySharpe/CinemaCache",
        "mediaLink": "https://www.youtube.com/embed/h2u1L17356E?autoplay=1"
      }
]